Mon-ius/Smart_System_Assignment_PXL/Assignment_1/CC3200/http_sensor/main.c
static char **getUrl(char *urls)
{
    char **tokens = 0;
    char **res = 0;
    char *domain = 0;
    char *url = 0;
    char *lurls = urls;

//    UART_PRINT("urls: %s\n", lurls);
    tokens = str_split(lurls, '/');
//    UART_PRINT("urls: %s\n", lurls);
    if (tokens)
    {
        int i;
//         domain=malloc(strlen(tokens[0])+1);
//         strcpy(domain,tokens[0]);
        domain = strdup(tokens[0]);
//        UART_PRINT("res: %s\n", domain);
//        UART_PRINT("url len: %d\n", strlen(tokens[0]));
//        UART_PRINT("domain len: %d\n", strlen(domain));
//        UART_PRINT("domain : %s\n", domain);
//        UART_PRINT("lurls len: %d\n", strlen(lurls));
//        UART_PRINT("lurls : %s\n", lurls);
        url = malloc(strlen(lurls)-strlen(tokens[0])+1);
        url[0] = '\0';
//        UART_PRINT("URL CREAT SUCCESSFUL %d",strlen(lurls)-strlen(tokens[0])+1);
//        UART_PRINT("DOMAIN %s \n",domain);
//        UART_PRINT("TOKEN %s \n",tokens[1]);
        for (i = 1; *(tokens + i); i++)
        {
//            UART_PRINT("TOKEN i %s\n",tokens[i]);
//            UART_PRINT("RES i %s\n",url);
            strcat(url, "/");
            strcat(url, *(tokens + i));
//            UART_PRINT("res: %s\n", url);
                // free(url);
            free(*(tokens + i));
        }
//        UART_PRINT("url: %s\n", url);
        free(tokens);
    }

    res = malloc(2 * sizeof(char *));
    res[0] = domain;
    res[1] = url;
    // strcpy(res[0], domain);
    // strcpy(res[1], url);

    // free(domain);
    // free(url);
//    UART_PRINT("Function getUrl domain: %s\n", domain);
//    UART_PRINT("Function getData data location : %x\n", domain);
//
//    UART_PRINT("Function getUrl url: %s\n", url);
//    UART_PRINT("Function getData url location : %x\n", url);
    return res;
}
static char *getData( char *data)
{
    char **tokens = 0;
    size_t count = 0;
    char *res = 0;
    char *ldata = data;

    UART_PRINT("Function getData data: %s\n", ldata);
    tokens = str_split(ldata, ',');
    while(*(tokens+count++)){}

    if (tokens)
    {
        int i;
        res = malloc(10 + 2 * count + strlen(ldata) + 1);
        res[0]='\0';
        //
        strcat(res, "{");
        for (i = 0; *(tokens + i); i++)
        {
            char **tmp=0;
//            UART_PRINT("DATA Token i: %s\n", tokens[i]);
//            UART_PRINT("DATA res i: %s\n", res);
            tmp = str_split(*(tokens + i), '=');
            // printf("%s %s",*(tmp),*(tmp+1));
            strcat(res, "\n\"");
            strcat(res, *(tmp));
            strcat(res, "\":\"");
            strcat(res, *(tmp + 1));
            strcat(res, "\"");
            if (*(tokens + i + 1) != NULL)
                strcat(res, ",");
            else
                strcat(res, "\n}");
//            free(*(tmp + 0));
//            free(*(tmp +1));
//            free(tmp);
            free(*(tokens + i));
        }
        free(tokens);
    }


    return res;
}



static int Post_Temp(HTTPCli_Handle httpClient,char *url,char *dat)
{
    bool moreFlags = 1;
    bool lastFlag = 1;
    char tmpBuf[4];
    long lRetVal = 0;

    char **mass;
    char *data;

    char *lurl = url;
    char *ldat = dat;



    mass = getUrl(lurl);

    data = getData(ldat);
//    UART_PRINT("|||||||%s||||||||||\n",data);

    UART_PRINT("|||||||%s||||||||||\n",data);
    UART_PRINT("------%s----------\n",mass[0]);
    UART_PRINT("Loc DOMAIN: %x\n", mass[0]);
    UART_PRINT("^^^^%s^^^^^^^^^^^^\n",mass[1]);
    UART_PRINT("Loc URL: %x\n", mass[1]);
//
//
//
//
//    UART_PRINT("------%s----------\n",mass[0]);
//    UART_PRINT("Loc DOMAIN: %x\n", mass[0]);
//    UART_PRINT("^^^^%s^^^^^^^^^^^^\n",mass[1]);
//    UART_PRINT("Loc URL: %x\n", mass[1]);






    HTTPCli_Field fields[4] = {
                                {HTTPCli_FIELD_NAME_HOST, mass[0]},
                                {HTTPCli_FIELD_NAME_ACCEPT, "*/*"},
                                {HTTPCli_FIELD_NAME_CONTENT_TYPE, "application/json"},
                                {NULL, NULL}
                            };


    /* Set request header fields to be send for HTTP request. */
    HTTPCli_setRequestFields(httpClient, fields);

    /* Send POST method request. */
    /* Here we are setting moreFlags = 1 as there are some more header fields need to send
       other than setted in previous call HTTPCli_setRequestFields() at later stage.
       Please refer HTTP Library API documentaion @ref HTTPCli_sendRequest for more information.
    */
    moreFlags = 1;
    lRetVal = HTTPCli_sendRequest(httpClient, HTTPCli_METHOD_POST, mass[1], moreFlags);
//    UART_PRINT("xxxxxxxxxxxxx%d\n",sizeof(POST_DATA)-1);
//    UART_PRINT("iiiiiiiiiiii%d\n",sizeof(data)-1);
//    char t[] = "{\n\"value\":\"69\",\n\"place\":\"pxl\"\n}";
//    UART_PRINT("wwwwwwwwwwwwwwwwwwwwww%d\n",sizeof(t)-1);
//    char * t1 = "{\n\"value\":\"69\",\n\"place\":\"pxl\"\n}";
//    char t2 [] = "{\n\"value\":\"69\",\n\"place\":\"pxl\"\n}";
//
//    UART_PRINT("xxxxxxxxxxxxxxxxxxxxxxxxx");
//    UART_PRINT("%s\n",t1);
//    UART_PRINT("%d\n",strlen(t1));
//    UART_PRINT("%d\n",sizeof(t1));
//    UART_PRINT("%s\n",t2);
//    UART_PRINT("%d\n",strlen(t2));
//    UART_PRINT("%d\n",sizeof(t2));
//
//    UART_PRINT("%d\n",strlen(data));
//    UART_PRINT("xxxxxxxxxxxxxxxxxxxxxxxxx");


    free(*(mass));
    free(*(mass + 1));
    free(mass);
    if(lRetVal < 0)
    {
        UART_PRINT("Failed to send HTTP POST request header.\n\r");
        return lRetVal;
    }

    sprintf((char *)tmpBuf, "%d", (strlen(data)));
//    UART_PRINT("vvvvvvvvvvvvv%d\n",sizeof(POST_DATA)-1);
//    UART_PRINT("vvvvvvvvvvvvv%d\n",strlen(data));
    /* Here we are setting lastFlag = 1 as it is last header field.
       Please refer HTTP Library API documentaion @ref HTTPCli_sendField for more information.
    */
    lastFlag = 1;
    lRetVal = HTTPCli_sendField(httpClient, HTTPCli_FIELD_NAME_CONTENT_LENGTH, (const char *)tmpBuf, lastFlag);
    if(lRetVal < 0)
    {
        UART_PRINT("Failed to send HTTP POST request header.\n\r");
        return lRetVal;
    }


    /* Send POST data/body */
    lRetVal = HTTPCli_sendRequestBody(httpClient, data, (strlen(data)));
    if(lRetVal < 0)
    {
        UART_PRINT("Failed to send HTTP POST request body.\n\r");
        return lRetVal;
    }
    free(data);

    lRetVal = readResponse(httpClient);

