Mon-ius/Smart_System_Assignment_PXL/Assignment_1/CC3200/http_sensor/main.c
    return lRetVal;
}
//*****************************************************************************
void
TimerBaseIntHandler(void)
{

    flag++;
    //
    // Clear the timer interrupt.
    //
    Timer_IF_InterruptClear(g_ulBase);

    g_ulTimerInts ++;
}
int main()
{
    long lRetVal = -1;

    const char *url="xxiot.herokuapp.com/api/temps";
    char buffer[128];
    HTTPCli_Struct httpClient;
    //
    // Board Initialization
    //
    BoardInit();

    //
    // Configure the pinmux settings for the peripherals exercised
    //
    PinMuxConfig();

    //
    // Configuring UART
    //
    InitTerm();

    //
    // Display banner
    //
    DisplayBanner(APP_NAME);

    InitializeAppVariables();
    //
     // I2C Init
     //
     lRetVal = I2C_IF_Open(I2C_MASTER_MODE_FST);
     if(lRetVal < 0)
     {
         ERR_PRINT(lRetVal);
         LOOP_FOREVER();
     }

     //Init Temprature Sensor
     lRetVal = TMP006DrvOpen();

     if(lRetVal < 0)
     {
         ERR_PRINT(lRetVal);
         LOOP_FOREVER();
     }


    lRetVal = ConnectToAP();
    if(lRetVal < 0)
    {
        LOOP_FOREVER();
    }

    g_ulBase = TIMERA0_BASE;
    Timer_IF_Init(PRCM_TIMERA0, g_ulBase, TIMER_CFG_PERIODIC, TIMER_A, 0);

    //
    // Setup the interrupts for the timer timeouts.
    //
    Timer_IF_IntSetup(g_ulBase, TIMER_A, TimerBaseIntHandler);

    //
    // Turn on the timers feeding values in mSec
    //
    Timer_IF_Start(g_ulBase, TIMER_A, 6000);

    //
    // Loop
    GPIOPinWrite(GPIOA1_BASE,0x2,~0x2);
    long i=0;
    while(1){
        if (flag > 99)
        {
        i=i+1;
        lRetVal = ConnectToAP();
        if(lRetVal < 0)
        {
            LOOP_FOREVER();
        }
        lRetVal = ConnectToHTTPServer(&httpClient);
        if(lRetVal < 0)
        {
            LOOP_FOREVER();
        }
        float fCurrentTemp;
        TMP006DrvGetTemp(&fCurrentTemp);
        UART_PRINT("temp - %d :            %f\n\r", i,fCurrentTemp);

        snprintf(buffer, sizeof(buffer), "value=%f,place=%s", fCurrentTemp,"pxltestV2");


        lRetVal = Post_Temp(&httpClient,url,buffer);
////        lRetVal = HTTPPostMethod(&httpClient);
        free(buffer);
        if(lRetVal < 0)
        {
            UART_PRINT("HTTP Post Get failed.\n\r");
        }
        UART_PRINT("HTTP Get End:\n\r");
        UART_PRINT("\n\r");
        UART_PRINT(dataBuffer);
        if (dataBuffer[1]=='F'){
            UART_PRINT("False\n\r");
            GPIOPinWrite(GPIOA1_BASE,0x2,~0x2);
        }
        else{
            UART_PRINT("True\n\r");
            GPIOPinWrite(GPIOA1_BASE,0x2,0x2);
        }

        flag=0;
        HTTPCli_disconnect(&httpClient);
        sl_WlanDisconnect();
        }


    }
    // Stop the CC3200 device

    LOOP_FOREVER();
}

